import random

class Strings:
    emoji = random.choice(["야발","어쩌라고요,,,,","☆*:.｡. o(≧▽≦)o .｡.:*☆","༼ ༎ຶ ෴ ༎ຶ༽","༼; ́༎ຶ ۝༎ຶ`༽","༼; ́༎ຶ + ༎ຶ༽]","(╬ ಠ 益ಠ)","ಥಒ್ಲಥ","ꂧ᷆◞८̯◟ꂧ᷆","૮(ꂧꁞꂧ)ა","(๑≖ิټ≖ิ)","(´⊙ω⊙`)","( ́◞ิ౪◟ิ‵)","ᓀ( ́◒`๑)","(ง ̇∇ ̇)ว(ว ̇∇ ̇)ง"])
    roll = random.choice(["데구르르 꽝","꽝 데구르르","데구르르 뎅강","ㄷㄱㄹㄹ ㄷㄱ","야랄,,, 너나 구르세요"])
    command_prefixes = {
        'help' : ["도움말","명령어","help","?","도와줘"],
        'choice' : ["골라","뽑아","chose"],
        '배워' : ["배워","익혀","study"],
        '잊어' : ['잊어',"forget"],
        '구글검색' : ['구글검색','사진검색','사진가져와', '사진'],
        '사전검색' : ['사전검색','지식검색','네이버검색', '사전'],
        '굴러' : ["구르기","앞구르기","뒷구르기","데굴데굴","굴러","뒹굴뒹굴","rnffj","eprnfmfm","Rhkd"],
        '닉네임' : ["이름","구분"],
        'custom' : ["커스텀","커맨드","사용자지정"],
        'study' : ["공부","스터디","study","learning"],
        'Hello' : ["Hello",'hello','안녕','ㅎㅇ','하이','깔롤랭'],
        '급식' : ['급식','밥','배고파']
    }
    commands = {
        'help' : ["샤키명령어","샤키도움말"]


    }
    custom = [
        '배워',
        '잊어'
    ]
